[
    {
        "id": 1,
        "prName": "Paula's Choice Pore Normalizing Cleanser",
        "expires": "2024-04-30T23:59:59",
        "opened": "2023-12-17T21:03:10",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 1,
        "categoryId": 1,
        "description": "Key ingredients: Glycerine, Panthenol (Vitamin B5), Sodium Laureth Sulfate. Use morning and evening. ",
        "important": false
    },
    {
        "id": 2,
        "prName": "Yves Rocher Cleansing gel 3-in-1 - Pure Algue",
        "expires": "2026-10-31T23:59:59",
        "opened": null,
        "expiresInDays": 182,
        "imgUrls": ["", ""],
        "userId": 2,
        "categoryId": 1,
        "description": "The gel is intended for normal to combination skin that sometimes feels tight, is dull and lacks moisture. Suggested use: Apply morning and evening to slightly moistened skin of the face and eyes. Massage gently and then rinse. Dermatologically and ophthalmologically tested.",
        "important": false
    },
    {
        "id": 3,
        "prName": "Yves Rocher Orange Fondante Hand Cream",
        "expires": "2024-09-30T23:59:59",
        "opened": "2023-02-15T10:09:08",
        "expiresInDays": 1,
        "imgUrls": ["", ""],
        "userId": 2,
        "categoryId": 1,
        "description": "Melting formula with 98% ingredients of natural origin. Delicately moisturizes and perfumes the skin.",
        "important": false
    },
    {
        "id": 4,
        "prName": "The Ritual of Ayurveda Hair & Body Mist",
        "expires": "2025-12-31T23:59:59",
        "opened": "2023-07-27T19:38:31",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 7,
        "categoryId": 1,
        "description": "Combining the harmonising ingredients of Indian rose and sweet almond oil, the formula is alcohol-free and therefore ideal for sensitive skin. This hair and body mist with 90% ingredients of natural origin is carefully curated to benefit your skin optimally.",
        "important": false
    },
    {
        "id": 5,
        "prName": "COMPEED Anti Blister Stick",
        "expires": "2024-11-30T23:59:59",
        "opened": "2023-05-18T13:26:09",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 2,
        "categoryId": 5,
        "description": "How to use: apply on feet or other parts of the body, whenever you want to prevent excessive rubbing. WARNINGS: Do not use on already formed blisters or open wounds. For already formed blisters, use Compeed blister plasters. Should not be used in children under 36 months. Do not store above 30°C",
        "important": true
    },
    {
        "id": 6,
        "prName": "CAF eye drops for dogs and cats",
        "expires": "2024-02-31T23:59:59",
        "opened": "2023-12-13T22:16:52",
        "expiresInDays": 14,
        "imgUrls": ["", ""],
        "userId": 7,
        "categoryId": 4,
        "description": "Dosage: Externally, in the inferior conjunctival sac. The recommended dosage and dosage interval is: 1-2 'drops' at least 4 times a day. Side effects: In dogs, reversible aplastic anemia may exceptionally occur, while in cats a reversible morphological change in the blood count may occur. Method of storage: Opened tube 14 days at room temperature (15-25°C). Store tube upright (cap on top).",
        "important": true
    },
    {
        "id": 7,
        "prName": "Meloxidyl 0.5mg/15ml",
        "expires": "2025-09-31T23:59:59",
        "opened": "2023-12-14T18:27:41",
        "expiresInDays": 182,
        "imgUrls": ["", ""],
        "userId": 4,
        "categoryId": 4,
        "description": "Meloxidyl 0.5 mg/ml suspension provides relief from inflammation and pain in chronic musculoskeletal disorders in cats. It also provides relief from mild to moderate acute pain and inflammation after surgical procedures. The suspension can easily be administered with the measuring syringe that is supplied and may only be administered orally by mixing the suspension with food or giving it directly into the mouth. Dosage: For oral use. Shake well before use. The treatment is a single dose of 0.1 mg meloxicam per kg body weight once a day. Treatment should be continued with an interval of 24 hours. It is important to dose accurately. The suspension can be given with the measuring syringe supplied in the package. The syringe fits onto the vial and has a division based on kg body weight that corresponds to the maintenance dose (in other words: 0.1 mg meloxicam/kg body weight). A clinical effect is usually observed within 3 - 4 days. Treatment should be discontinued after 10 days at the latest if there is no clinical improvement.",
        "important": true
    },
    {
        "id": 7,
        "prName": "Kiehl's Ultra Facial Cream",
        "expires": "2025-03-28T23:59:59",
        "opened": "2023-11-05T12:27:51",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 8,
        "categoryId": 1,
        "description": "Suitable for all skin types, including sensitive skin. Also suitable for men. Formulated with Glacial Glycoprotein Extract, sourced from glaciers, and Squalane, sourced from olive oil. Apply a small amount of our moisturizing facial cream to cleansed skin. Can be applied twice daily, morning and evening, as part of the skin care routine",
        "important": false
    },
    {
        "id": 8,
        "prName": "OLAPLEX Hair Perfector #3",
        "expires": "2026-02-28T23:59:59",
        "opened": null,
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 5,
        "categoryId": 1,
        "description": "HOW TO USE: Before washing, dampen hair and apply Nº3 Hair Perfector™ from roots to ends. Leave on for 10 minutes for maximum effect. Rinse well, then wash and care. WHEN TO USE: Use Nº3 Hair Perfector™ once a week, or up to 3x a week for very damaged hair. FOR WHOM: For all hair types, but mainly for damaged hair.",
        "important": false
    },
    {
        "id": 9,
        "prName": "ARTDECO Mineral Powder Fondation #340",
        "expires": "2025-06-30T23:59:59",
        "opened": null,
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 9,
        "categoryId": 2,
        "description": "Protective loose powder for a smooth and even matte finish. Perfect for sensitive and oily skin. The most important ingredients and their effects: Zinc oxide offers protection against UVA and UVB rays and protects the skin. Compatibility: dermatologically approved, sensitive skin",
        "important": true
    },
    {
        "id": 10,
        "prName": "Color WoW Dream Coat Supernatural Spray",
        "expires": "2026-05-31T23:59:59",
        "opened": null,
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 10,
        "categoryId": 1,
        "description": "The spray gives the hair a protective layer and ensures that the hair does not become frizzy. Usage: Use a shampoo and conditioner first. Then divide the damp hair into sections and spray the Color WoW Dream Coat Supernatural Spray very liberally and evenly on towel-dried hair. Use the Dream Coat on the entire hair. Liberal use does not lead to weight loss because the Dream Coat is very light/thin, comparable to water. The hair will absorb the Dream Coat. Then dry the hair with the hairdryer. The heat activates the Dream Coat. Use a brush to keep each section taut while blow-drying. For best results, do not use other styling products on damp hair once you have applied the Dream Coat. Styling products can be used again once the hair is dry. The more you use the Dream Coat, the less you need to maintain the same end result.",
        "important": false
    },
    {
        "id": 11,
        "prName": "Caudalie Vinopure Purifying Lotion",
        "expires": "2026-10-31T23:59:59",
        "opened": "2023-04-30T21:39:51",
        "expiresInDays": 273,
        "imgUrls": ["", ""],
        "userId": 6,
        "categoryId": 1,
        "description": "Skin type : Acne sensitive skin. Also use if you have: Imperfections, dilated pores, blackheads, oily skin. Main ingredients : Natural Salicylic Acid, Organic Grape Water, 6 purifying essential oils.Application advice: Apply morning and evening to cleansed skin with a cotton pad or clean fingers, avoiding the eye contour. Do not rinse. The Vinotherapist's advice: The Vinopure Lotion can be applied without a cotton pad, but with clean fingers.",
        "important": true
    },
    {
        "id": 12,
        "prName": "Nail Polish Remover",
        "expires": "2024-02-29T23:59:59",
        "opened": "2023-07-22T15:58:10",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 10,
        "categoryId": 2,
        "description": "NailPerfect Nail Polish Remover Non Acetone is a nail polish remover on a non-acetone base. With this product you can also remove nail polish and artificial nails without becoming dull.",
        "important": false
    },
    {
        "id": 13,
        "prName": "Charlotte Tilbury Glowgasm Beauty Light Wand",
        "expires": "2024-02-29T23:59:59",
        "opened": null,
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 6,
        "categoryId": 2,
        "description": "Product use: Apply to your cheekbones, brow bone and cupid's bow and blend into the skin for a dazzling highlight.",
        "important": false
    },
    {
        "id": 14,
        "prName": "California Gold Nutrition Vitamin C 1000mg",
        "expires": "2024-03-31T23:59:59",
        "opened": "2023-11-19T07:32:08",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 10,
        "categoryId": 3,
        "description": "Suggested use: Take 1 capsule daily, with or without food. Best when taken as directed by a qualified healthcare professional. Main Ingredients: Vitamin C (as ascorbic acid). Other Ingredients: Hydroxypropyl Methylcellulose (Veggie Capsule) and Magnesium Stearate. Best stored at controlled room temperature 20°C to 25°C (68°F to 77°F). Improper storage conditions, such as extended exposure to direct sunlight, high heat & humidity can cause product degradation over time.",
        "important": true
    },
    {
        "id": 15,
        "prName": "Doctor's Best Pure Collagen Types 1 and 3 Powder",
        "expires": "2026-06-30T23:59:59",
        "opened": "2023-09-18T23:59:59",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 10,
        "categoryId": 3,
        "description": "Suggested Adult Use: Dissolve 1 scoop of powder in a small amount of water or juice. Add an additional 6-8 oz. of liquid, mix well, and drink on an empty stomach at least 30 minutes before meals, or as recommended by a nutritionally-informed physician. To ensure optimal collagen absorption, avoid taking additional protein supplements within one hour of consumption. Store in a cool dry place. Serving Size: 1 scoop (~6.6 grams)",
        "important": true
    },
    {
        "id": 16,
        "prName": "Doctor's Best Calcium Bone Maker",
        "expires": "2024-07-31T23:59:59",
        "opened": "2023-05-01T10:05:47",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 9,
        "categoryId": 3,
        "description": "Suggested Use: Take three (3) capsules twice daily with food, or as recommended by a nutritionally-informed physician. Drink 6-8 cups of water throughout the day to avoid constipation. Do not exceed recommended daily dose. Warnings: Consult your physician before using this product if you are pregnant, nursing, have thyroid or kidney problems, or if using blood thinning medication. Store in a cool dry place.",
        "important": true
    },
    {
        "id": 17,
        "prName": "Aleve Feminax",
        "expires": "2028-02-29T23:59:59",
        "opened": "2023-10-23T19:32:15",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 6,
        "categoryId": 3,
        "description": "Menstrual pain is often most severe on the first day, because that is when the concentration of prostaglandins is highest. In case of early menstrual pain, we recommend an initial dose of 2 Aleve Feminax tablets at the same time. This prevents the amount of prostaglandins from rising too high and causing menstruation to become painful. If necessary, you can take another Aleve Feminax tablet after 8 to 12 hours until the complaints have passed.",
        "important": true
    },
    {
        "id": 18,
        "prName": "Trachitol",
        "expires": "2025-04-30T23:59:59",
        "opened": "2023-11-24T22:38:10",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 4,
        "categoryId": 3,
        "description": "Dosage: Adults and young adults from 12 to 18 years: Up to 8 lozenges per day, with a maximum of 1 tablet every 2 hours. Allow the lozenge to slowly dissolve in the mouth. Do not swallow or chew. The treatment should not last longer than 7 days. Children between 6 and 11 years: Up to 6 lozenges per day, with a maximum of 1 tablet every 2 hours. The medicine should be administered under adult supervision. Warnings: If the sore throat lasts longer than 3 days, it is wise to contact your doctor. Store in a dry and dark place at room temperature (15-25 ºC). Keep out of reach of young children.",
        "important": true
    },
    {
        "id": 19,
        "prName": "Fluimucil 200mg",
        "expires": "2026-03-31T23:59:59",
        "opened": "2023-11-22T17:29:08",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 4,
        "categoryId": 3,
        "description": "Dosage restriction: Adults and children over 7 years: 1 tablet 3 times a day. Children from 2 to 7 years: 1 orodispersible tablet 2 times a day. Allow the tablet to melt in your mouth and then swallow. Do not use in case of: - hypersensitivity to acetylcysteine or one of the excipients; - children and pregnant women with phenylketonuria; - children under 2 years of age",
        "important": true
    },
    {
        "id": 20,
        "prName": "Imodium",
        "expires": "2026-04-30T23:59:59",
        "opened": "2023-12-07T15:18:03",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 5,
        "categoryId": 3,
        "description": "Usage: Short-term (acute) diarrhea: The starting dose is 2 tablets (4 mg) for adults and 1 tablet (2 mg) for children; then take 1 tablet after each subsequent loose bowel movement. Long-term (chronic) diarrhea and inability to retain stools: Start with 2 tablets per day for adults and 1 tablet per day for children. This dose is adjusted until 1 or 2 firmer bowel movements occur per day. This effect is usually achieved with a maintenance dose of 1 to 6 tablets per day. Adults should never take more than 8 tablets per day and children",
        "important": true
    },
    {
        "id": 21,
        "prName": "Goldwell Men Thickening Shampoo",
        "expires": "2026-08-31T23:59:59",
        "opened": "2023-02-25T16:10:33",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 5,
        "categoryId": 1,
        "description": "This shampoo provides more fullness and volume. The shampoo gently cleanses and thickens the hair: Has a mild cleansing effect; Developed for fine and thin hair; Powerful appearance from the start ",
        "important": false
    },
    {
        "id": 22,
        "prName": "Nivea Men After Shave Balm",
        "expires": "2023-12-31T23:59:59",
        "opened": "2022-11-21T23:01:46",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 3,
        "categoryId": 1,
        "description": "NIVEA MEN Sensitive After Shave Balm 100ml for men with sensitive skin who want to immediately soothe their irritated and red skin.",
        "important": false
    },
    {
        "id": 23,
        "prName": "Chloorhexidine oplossing",
        "expires": "2025-10-31T23:59:59",
        "opened": "2023-08-12T14:58:41",
        "expiresInDays": 182,
        "imgUrls": ["", ""],
        "userId": 9,
        "categoryId": 3,
        "description": "Kruidvat Chlorhexidine contains 0.5% chlorhexidine digluconate in 70% alcohol. Each ml of application fluid contains 5 mg chlorhexidine digluconate. How do you use: For application on the skin: apply to the skin with a cotton ball or gauze soaked in Kruidvat Chlorhexidine solution. Suitable for external use. Keep out of the sight and reach of children. Store in the original packaging. Store at room temperature.",
        "important": false
    },
    {
        "id": 24,
        "prName": "The Ordinary Niacinamide 10% + Zinc 1%",
        "expires": "2024-01-31T23:59:59",
        "opened": "2023-02-03T14:45:27",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 3,
        "categoryId": 1,
        "description": "A universal serum for blemish-prone skin that smooths, brightens, and supports. Targets: Textural Irregularities, Dryness, Dullness, Visible Shine, Signs of Congestion. Suited to: All Skin Types. Format: Water-based Serum. Key ingredients: Niacinamide, Zinc PCA",
        "important": true
    },
    {
        "id": 25,
        "prName": "Bepanthen Wongel",
        "expires": "2025-09-30T23:59:59",
        "opened": "2023-04-21T16:29:04",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 7,
        "categoryId": 3,
        "description": "How to use: Clean the open wound with water. Then apply the Bepanthen Wound Gel thinly, but do not rub it in. You can then apply bandages or plasters if necessary. You can repeat this as many times as necessary. ",
        "important": true
    },
    {
        "id": 26,
        "prName": "Nuxe Merveillance Lift",
        "expires": "2024-01-31T23:59:59",
        "opened": "2023-07-06T23:59:04",
        "expiresInDays": 182,
        "imgUrls": ["", ""],
        "userId": 6,
        "categoryId": 1,
        "description": "Firming night cream - wrinkle correction, firming. Massage until the cream is completely absorbed. In the evening, ideally after the serum.",
        "important": false
    },
    {
        "id": 27,
        "prName": "Vichy Soothing after-sun milk",
        "expires": "2024-12-31T23:59:59",
        "opened": null,
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 8,
        "categoryId": 1,
        "description": "NEEDS: Additional sun care. The hypoallergenic formula has been dermatologically tested on sensitive skin. ",
        "important": false
    },
    {
        "id": 28,
        "prName": "Erborian CC Cream Clear",
        "expires": "2024-08-31T23:59:59",
        "opened": "2022-11-13T15:19:05",
        "expiresInDays": 365,
        "imgUrls": ["", ""],
        "userId": 3,
        "categoryId": 2,
        "description": "CC CREAM CLAIR contains: Tiger grass Anti-inflammatory, promotes healing; Honey extract Soothes and heals the skin; Vitamin E Against free radicals, high skin protection. Tested under dermatological supervision. The CC cream is ideal to replace foundation or a tinted moisturizer for a flawless finish. Simply apply a thin layer to your face, either after or instead of your moisturizer.",
        "important": false
    },
    {
        "id": 30,
        "prName": "Peter Thomas Roth Pumpkin Enzyme Mask",
        "expires": "2026-10-31T23:59:59",
        "opened": "2023-08-17T07:46:14",
        "expiresInDays": 547,
        "imgUrls": ["", ""],
        "userId": 4,
        "categoryId": 1,
        "description": "Apply a thin layer to clean skin. Gently massage in a circular motion with wet fingertips to polish with micro-polishing aluminum oxide powder. Leave on for 3-7 minutes depending on skin sensitivity and let the AHAs and enzymes work. Rinse thoroughly. Use one or two times per week.",
        "important": false
    }

]
